/*****************************************************************************
 *   debug_drv.c:  debug app
 *
 *   Copyright(C) 2013, cc
 *   All rights reserved.
 *
 *   History
 *   2013.05.24  ver 1.00    Prelimnary version, first Release
 *

 取决于硬件版本 CC-ACC-VH02  
******************************************************************************/

#include "debug_led.h"

void L3_debug_led_init(void)
{
	D_led_THB_init();
	D_led_DEBUG_init();
}
/******************************************************************************
**                            End Of File
******************************************************************************/
