/*****************************************************************************
update by cc @201700110
Õë¶Ô¶à´®¿Ú ºÍ µ¥Ò»´®¿Ú ÓĞÇø±ğ Ã¿¸ö´®¿ÚÊÇ¶ÀÁ¢µÄ»¹ÊÇ·Ö¿ªµÄÓĞ½²¾¿ ³ÌĞòÊÇ¸´ÔÓµÄ»¹ÊÇÈí¼şÓ¦ÓÃ¼òµ¥ÊÇ
¸öĞèÒªÆ½ºâµÄÊÂÇé.

clib/clib.c:  
¹«ÓÃµÄº¯Êı 	ºÍÓ²¼şÎŞ¹Ø 
·ÅÖÃ´®ĞĞÄ£Ê½(´®¿ÚµÈÆäËûÍ¨Ñ¶×ÜÏßÀàµÄÊä³ö)Êä³öµÄº¯Êı,
Ò»Ğ©¸²¸ÇÄ£Ê½Êä³öµÄ(lcdµÈ¹ÌÆÁÊä³öµÄ)µÄÒ²¿ÉÊ¹ÓÃ  
					void Lc_print(void (*L0pf_send_uc)(char ww), char *dat,...)
-----------------------------------------------------------------------------------------
uartcom/Uprotocol2app  
  Ğ­Òéµ½Ó¦ÓÃ
  ÎªÁËÊÊÓ¦²»Í¬µÄÍ¨Ñ¶Ğ­ÒéĞèÒª²»Í¬µÄuart¿ÚÀ´¶ÔÓ¦ ºÍÓ¦ÓÃÏà¹Ø

typedef struct _ts_lcm_pro_; Ó¦ÓÃĞ­Òé°üµÄ¶¨Òå¼     LCMµÄĞ­Òé------------
											L3_UARTcom0_exp_protocol ½âÎöÓ¦ÓÃĞ­Òé
-----------------------------------------------------------------------------------------
uartcom/urec2protocol: ½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½Ö¸ÏòÌØ¶¨Ğ­ÒéµÄ»º´æÖĞ£¬ºÍĞ­ÒéµÄ¸ñÊ½ÓĞ¹Ø Ò»°ã·ÖÎª ±êÍ·Ê½»òÕß±êÎ²Ê½
¹«ÓÃµÄ´®¿ÚÍ¨Ñ¶¶¨Òå		
 	struct _s_protocol_ µÄ¹«¹²Ğ­Òé°ü(¹Ø¼üµÄ½á¹¹Ìå)µÄÉùÃ÷------struct _s_protocol_
 							void L1_uart_2buf(struct _s_protocol_ *p)´®ĞĞÊı¾İ±£´æµ½Ö¸ÏòÌØ¶¨Ğ­ÒéµÄ»º³åÖĞ
--------------------------------------------------------------------------------------------
msp/uartx.c    µ×²ã´úÂë	 ºÍcpuÏà¹Ø »º´æ·¢ËÍÒ²·ÅÔÚÀïÃæ
			L0_UART0_Init
						UART0_IRQHandler
						    	L0_Usend_uc------UserDef
-----------------------------------------------------------------------------------------
********************************************************************************/



#ifndef __urec2protocol_H 
#define __urec2protocol_H

#include "../clib/type.h"	


#define D_s_protocol_len	64		//strÀàµÄĞ­ÒéĞèÒª³¤¶È´óÒ»Ğ©£¬ÈİÒ×bugµÄµØ·½£¬ÏŞÖÆÎª½ÓÊÕ64bytesµÄÊı¾İ
struct _s_protocol_
{//8byte
	U8 	rbr;
	U8 	filter1;
	U8 	filter2;	
	U8  (*pfun_get)(void);	
    U8 	num;  	//½ÓÊÕµ½µÄÊıÄ¿×¢ÒâÊı¾İ³¤¶ÈµÄ·¶Î§
    U8 	max;  	//½ÓÊÕµ½µÄÊıÄ¿µÄ×î´óÖµ
    U8 	sub_num;  	//½ÓÊÕµ½µÄÊıÄ¿×¢ÒâÊı¾İ³¤¶ÈµÄ·¶Î§
    U8 	head;	//½ÓÊÕ±êÖ¾Í·±êÖ¾
    U8 	ok;		//½ÓÊÕĞ­Òéok±êÖ¾
    U8 	data_ok;		//½ÓÊÕĞ­Òéok±êÖ¾   
    U8 	ucXor;   
    U8 	close;   
	U8 	cashe[4];
    U8 	array[D_s_protocol_len+1];//buffer µÄµÚÒ»Î»ÊÇ    ³¤¶È	 	 
    U8 	buf[D_s_protocol_len + 1];	//buffer µÄµÚÒ»Î»ÊÇ    ³¤¶È	 	  
    U8 	pro[16];				///½âÎöĞ­ÒéÓÃ	 	  
}; 

typedef struct 
{
	void(*L1_uart_rx_handle	)(struct _s_protocol_ *p);
	struct _s_protocol_ *st;

	
}Ts_uart_configRX_;


#ifdef doc43324234
__packed struct _s_uart_config_
{//8byte
    BYTE type;		//	lkt4105 µÄÀàĞÍ
	UN_TYPE usart;
	uint32_t baudrate;
	uint32_t uart_mode;	// 1200,n,8,1
	Ts_uart_configRX_ *puart_config;
	BYTE d[D_s_protocol_len];

//	E =evenÅ¼Ğ£ÑéN = noneÎŞĞ£Ñé
//		´®¿ÚÍ¨ĞÅÊÇ11Î»£¬°üº¬ÆğÊ¼Î»£¬8¸öÊı¾İÎ»£¬Ğ£ÑéÎ»£¬Í£Ö¹Î»£¬Å¼Ğ£Ñé£ºËùÓĞ´«ËÍµÄÊıÎ»(º¬×Ö·ûµÄ¸÷ÊıÎ»ºÍĞ£ÑéÎ»)ÖĞ, "1" µÄ¸öÊıÎªÅ¼Êı¡£¼ÙÈç·¢ËÍ0x06,°´Î»¾ÍÊÇ00000110£¬ÔòÅ¼Ğ£ÑéÎ»Éè0.¼ÙÈç·¢ËÍ0x07,°´Î»¾ÍÊÇ00000111£¬ÔòÅ¼Ğ£ÑéÎ»Éè1.
};

extern void L1_UProtocol_init(void);

#endif



extern void L1_uart_2hexbuf(struct _s_protocol_ *p);
extern void L1_uart_2strbuf(struct _s_protocol_ *p);
#endif /* end __urec2protocol_H */
/*****************************************************************************
**                            End Of File
******************************************************************************/
